package _01.base.lessonfirst;

public class _22_BitShift {

	public static void main(String[] args) {
		
		// 0000 0000 0000 0000 0000 0000 0000 1011 (11)     << 1      шифт влево на 1 - все биты смещ. на 1 влево, самый левый теряем, справа дополняем 0
        // 0000 0000 0000 0000 0000 0000 0001 0110 (22)    результат		
		int i = 11;
		int iShift = i << 1;
		System.out.println(iShift);
		
		// 0000 0000 0000 0000 0000 0000 0000 1011 (11)     << 2      шифт влево на 2 - все биты смещ. на 2 влево, самыe левыe теряем, справа дополняем 0
        // 0000 0000 0000 0000 0000 0000 0010 1100 (44)    результат			
		iShift = i << 2;
		System.out.println(iShift);
		
		// 0000 0000 0000 0000 0000 0000 0000 1011 (11)     << 4      шифт влево на 4 - все биты смещ. на 4 влево, самыe левыe теряем, справа дополняем 0
        // 0000 0000 0000 0000 0000 0000 1011 0000 (176)    результат			
		iShift = i << 4;
		System.out.println(iShift);
		
		// 0000 0000 0000 0000 0000 0000 0000 1011 (11)     >> 1      шифт вправо на 1 - все биты смещ. на 1 вправо, самыe правые теряем, слева дополняем 0
        // 0000 0000 0000 0000 0000 0000 0000 0101 (5)    результат			
		iShift = i >> 1;
		System.out.println(iShift);
		
		System.out.println(Integer.MAX_VALUE << 1); // -2
		
		
		
		
	}

}
